{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": 0,
    "1": 0,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0,
    "6": 0,
    "7": 1,
    "8": 1,
    "9": 1,
    "10": 1,
    "11": 2,
    "12": 2,
    "13": 2,
    "14": 2,
    "15": 2,
    "16": 2,
    "17": 3,
    "18": 3,
    "19": 3,
    "20": 3,
    "21": 4,
    "22": 4,
    "23": 5,
    "24": 6,
    "25": 6,
    "26": 7,
    "27": 7,
    "28": 7,
    "29": 7,
    "30": 7,
    "31": 7,
    "32": 7,
    "33": 7,
    "34": 7
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "0": 6,
    "1": 10,
    "2": 16,
    "3": 20,
    "4": 22,
    "5": 23,
    "6": 25,
    "7": 34
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.39.2"
}
